backend/app/models/order.rb

UPDATE `line_foods` SET `line_foods`.`order_id` = 1, `line_foods`.`active` = FALSE, `line_foods`.`updated_at` = '2022-08-02 00:04:21.040478' WHERE `line_foods`.`id` = 3
INSERT INTO `orders` (`total_price`, `created_at`, `updated_at`) VALUES (2100, '2022-08-02 00:04:21.026060', '2022-08-02 00:04:21.026060')
---
  def save_with_update_line_foods!(line_foods)
    ActiveRecord::Base.transaction do
      line_foods.each do |line_food|
        line_food.update!(active :false, order: self)
      end
      self.save!