backend/app/controllers/api/v1/foods_controller.rb

SELECT `restaurants`.* FROM `restaurants` WHERE `restaurants`.`id` = 1 LIMIT 1
---
      def index
        restaurant = Restaurant.find(params[:restaurant_id])