backend/app/controllers/api/v1/line_foods_controller.rb

SELECT `line_foods`.* FROM `line_foods` WHERE `line_foods`.`active` = TRUE
SELECT 1 AS one FROM `line_foods` WHERE `line_foods`.`active` = TRUE LIMIT 1
SELECT `restaurants`.* FROM `restaurants` WHERE `restaurants`.`id` = 3 LIMIT 1
---
      def index
        line_foods = LineFood.active

        if line_foods.exists?
          render json: {
            line_food_ids: line_foods.map{ |line_food| line_food.id },
            restaurant: line_foods[0].restaurant,
            count: line_foods.sum { |line_food| line_food[:count] },
            amount: line_foods.sum { |line_food| line_food.total_amount },
          }, status: :ok

SELECT `line_foods`.* FROM `line_foods` WHERE `line_foods`.`restaurant_id` != 3 ORDER BY `line_foods`.`id` ASC LIMIT 1
SELECT 1 AS one FROM `line_foods` WHERE `line_foods`.`active` = TRUE AND `line_foods`.`restaurant_id` != 1 LIMIT 1
SELECT `restaurants`.* FROM `restaurants` WHERE `restaurants`.`id` = 1 LIMIT 1
SELECT `restaurants`.* FROM `restaurants` WHERE `restaurants`.`id` = 3 LIMIT 1
INSERT INTO `line_foods` (`food_id`, `restaurant_id`, `count`, `active`, `created_at`, `updated_at`) VALUES (1, 1, 8, TRUE, '2022-07-30 05:22:34.774090', '2022-07-30 05:22:34.774090')
UPDATE `line_foods` SET `line_foods`.`count` = 7, `line_foods`.`active` = TRUE, `line_foods`.`updated_at` = '2022-08-02 00:07:56.177650' WHERE `line_foods`.`id` = 2
---
      def create
        if LineFood.active.other_restaurant(@ordered_food.restaurant.id).exists?
          return render json: {
            existing_restaurant: LineFood.other_restaurant(@ordered_food.restaurant.id).first.restaurant.name,
            new_restaurant: Food.find(params[:food_id]).restaurant.name,
          }, status: :not_acceptable
        end

        set_line_food(@ordered_food)

        if @line_food.save

SELECT `line_foods`.* FROM `line_foods` WHERE `line_foods`.`active` = TRUE AND `line_foods`.`restaurant_id` != 3
SELECT `restaurants`.* FROM `restaurants` WHERE `restaurants`.`id` = 3 LIMIT 1
UPDATE `line_foods` SET `line_foods`.`active` = FALSE, `line_foods`.`updated_at` = '2022-07-30 05:23:06.673285' WHERE `line_foods`.`id` = 1
INSERT INTO `line_foods` (`food_id`, `restaurant_id`, `count`, `active`, `created_at`, `updated_at`) VALUES (27, 3, 3, TRUE, '2022-07-30 05:23:06.705742', '2022-07-30 05:23:06.705742')
---
      def replace
        LineFood.active.other_restaurant(@ordered_food.restaurant.id).each do |line_food|
          line_food.update_attribute(:active, false)
        end

        set_line_food(@ordered_food)

        if @line_food.save

SELECT `foods`.* FROM `foods` WHERE `foods`.`id` = 6 LIMIT 1
---
      def set_food
        @ordered_food = Food.find(params[:food_id])

SELECT `line_foods`.* FROM `line_foods` WHERE `line_foods`.`food_id` = 1 LIMIT 1
---
      def set_line_food(ordered_food)
        if ordered_food.line_food.present?