backend/app/controllers/api/v1/line_foods_controller.rb

SELECT 1 AS one FROM `line_foods` WHERE `line_foods`.`active` = TRUE AND `line_foods`.`restaurant_id` != 1 LIMIT 1
---
      def create
        if LineFood.active.other_restaurant(@ordered_food.restaurant.id).exists?

SELECT `foods`.* FROM `foods` WHERE `foods`.`id` = 2 LIMIT 1
---
      def set_food
        @ordered_food = Food.find(params[:food_id])

SELECT `line_foods`.* FROM `line_foods` WHERE `line_foods`.`food_id` = 2 LIMIT 1
---
      def set_line_food(ordered_food)
        if ordered_food.line_food.present?