backend/app/controllers/api/v1/orders_controller.rb

SELECT `line_foods`.* FROM `line_foods` WHERE `line_foods`.`id` = 3
---
      def create
        posted_line_foods = LineFood.where(id: params[:line_food_ids])

SELECT `restaurants`.* FROM `restaurants` WHERE `restaurants`.`id` = 1 LIMIT 1
---
      def total_price(posted_line_foods)
        posted_line_foods.sum { |line_food| line_food.total_amount } + posted_line_foods.first.restaurant.fee