backend/app/controllers/api/v1/restaurants_controller.rb

SELECT `restaurants`.* FROM `restaurants`
---
      def index
        restaurants = Restaurant.all